app/controllers/order_controller.rb

  def index
    @posts = Order.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "orders".* FROM "orders" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def destroy
    order = Order.find(params[:id]).destroy
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]